Show / Hide Table of Contents
Enum DeflectionRequirementEc2
deflection calculation requirements
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum DeflectionRequirementEc2
Fields
 Name |  Description
 Advanced
Deflections that could damage adjacent parts of the structure should be limited.
 Normal
The appearance and general utility of the structure could be impaired when the calculated sag of a beam, slab or cantilever subjected to quasi-permanent loads exceeds span/250.
 Improve this Doc
 View Source